In [2]:
import pandas as pd

In [3]:
df1 = pd.DataFrame({'ID' :[1,2,3,4], 'class' :[9,10,11,12]})
df1

   ID  class
0   1      9
1   2     10
2   3     11
3   4     12

In [7]:
df2 = pd.DataFrame({'ID' :[1,2,6,4], 'Name' :['A','B','C','D']})
df2

   ID Name
0   1    A
1   2    B
2   6    C
3   4    D

In [8]:
pd.merge(df1,df2)

   ID  class Name
0   1      9    A
1   2     10    B
2   4     12    D

In [9]:
pd.merge(df1,df2,on='ID')

   ID  class Name
0   1      9    A
1   2     10    B
2   4     12    D

In [10]:
pd.merge(df1,df2)

   ID  class Name
0   1      9    A
1   2     10    B
2   4     12    D

In [11]:
 pd.merge(df1,df2,on='ID',how = 'inner')

   ID  class Name
0   1      9    A
1   2     10    B
2   4     12    D

In [13]:
pd.merge(df1,df2,on='ID',how = 'left')

   ID  class Name
0   1      9    A
1   2     10    B
2   3     11  NaN
3   4     12    D

In [14]:
pd.merge(df1,df2,on='ID',how='right')

   ID  class Name
0   1    9.0    A
1   2   10.0    B
2   4   12.0    D
3   6    NaN    C

In [16]:
df1,df2

(   ID  class
 0   1      9
 1   2     10
 2   3     11
 3   4     12,
    ID Name
 0   1    A
 1   2    B
 2   6    C
 3   4    D)

In [17]:
pd.merge(df1,df2,on='ID',how = 'outer')

   ID  class Name
0   1    9.0    A
1   2   10.0    B
2   3   11.0  NaN
3   4   12.0    D
4   6    NaN    C

In [18]:
pd.merge(df1,df2,on='ID',how = 'outer',indicator = True)

   ID  class Name      _merge
0   1    9.0    A        both
1   2   10.0    B        both
2   3   11.0  NaN   left_only
3   4   12.0    D        both
4   6    NaN    C  right_only

In [19]:
df1

   ID  class
0   1      9
1   2     10
2   3     11
3   4     12

In [20]:
df2

   ID Name
0   1    A
1   2    B
2   6    C
3   4    D

In [21]:
df3 = pd.DataFrame({'ID' :[5,6,7,8], 'Name' :['A','B','C','D']})
df3

   ID Name
0   5    A
1   6    B
2   7    C
3   8    D

In [25]:
pd.merge(df1,df3,left_index = True,right_index=True)

   ID_x  class  ID_y Name
0     1      9     5    A
1     2     10     6    B
2     3     11     7    C
3     4     12     8    D